package yao

var (
	//	taiji   = [2]string{"阳", "阴"} //阳为--,阴为- -
	//	liangyi = [2]string{"阳", "阴"}
	//sixiang = [4]string{"太阳", "少阴", "少阳", "太阴"}
	bagua = [8]string{"乾", "兑", "离", "震", "巽", "坎", "艮", "坤"}
	//xiang   = [8]string{"天", "泽", "火", "雷", "风", "水", "山", "地"}
	//定义0为阳,1为阴,方便取值
	//卦为从下往上写,方便绘图我从上往下保存
	writes = [8]uint8{0b000, 0b100, 0b010, 0b110, 0b001, 0b101, 0b011, 0b111} //从上向下写
// w=[8]string{"☰", "☱", "☲", "☳", "☴", "☵", "☶", "☷"}
)

/*
在占卦中,背(阳)面为阴,正(字)面为阳
两阳一阴为少阴 记 - -
两阴一阳为少阳 记 --
三阴为老阴 记 - - x
三阳为老阳 记 -- o

占卦法章:
占六次,从下往上排,得出六种卦,是为六爻(摇)
六卦为本卦
老阳老阴为变卦,阴阳变换,是为变卦

八宫六十四卦
*/
